_posts/2016-11-06-Justifying-LaTeX-preview-fragments-in-org-mode.html
---
title: Justifying LaTeX preview fragments in org-mode
date: 2016/11/06 20:44:53
updated: 2016/11/06 20:44:53
categories: emacs,orgmode,latex
tags: 
---


<p>
A colleague asked if I knew how to center the preview images of LaTeX equations in an org-buffer. This might make org-mode notes look nicer when lecturing, for example. We thought it might be possible to just offset the overlay with a before-string made up of the right number of spaces. I worked out a full solution that lets you "justify" the preview images. You have to add a :justify option to org-format-latex-options, and the option is either 'center or 'right (anything else means left-justified as the default). This will only justify equations that start at the beginning of a line to avoid modifying fragments that are in text. You should see the video to see this in action:
</p>

<iframe width="560" height="315" src="https://www.youtube.com/embed/nA9YzooqpWY" frameborder="0" allowfullscreen></iframe>

<p>
Equation 1:
\(e^{i\pi} + 1 = 0\)
</p>

<p>
An \(x^2 = -1\) equation in the text is not affected.
</p>

<p>
A display equation with some space after the equation:
\[e^{i \cdot \pi} + 1 = 0\]     
</p>

<p>
This is a numbered equation.
</p>

\begin{equation}
\int x^2 dx
\end{equation}

<p>
The idea is pretty simple, we get the width of the window, and the width of the image, and compute the offset that approximately centers or right justifies the overlay, and then add the before-string property to the overlay. While we are at it, I will add a tooltip to the image so you can see the LaTeX code that created it, and make it clickable so you can toggle it back to the code. 
I apply the functions as after advice to the function that creates the overlay, so we do not have to adapt the org code at all. Here is the code that does it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">specify the justification you want</span>
(plist-put org-format-latex-options <span style="color: #006FE0;">:justify</span> 'center)

(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">org-justify-fragment-overlay</span> (beg end image imagetype)
  <span style="color: #036A07;">"Adjust the justification of a LaTeX fragment.</span>
<span style="color: #036A07;">The justification is set by :justify in</span>
<span style="color: #036A07;">`</span><span style="color: #D0372D;">org-format-latex-options</span><span style="color: #036A07;">'. Only equations at the beginning of a</span>
<span style="color: #036A07;">line are justified."</span>
  (<span style="color: #0000FF;">cond</span>
   <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">Centered justification</span>
   ((<span style="color: #0000FF;">and</span> (eq 'center (plist-get org-format-latex-options <span style="color: #006FE0;">:justify</span>)) 
         (= beg (line-beginning-position)))
    (<span style="color: #0000FF;">let*</span> ((img (create-image image 'imagemagick t))
           (width (car (image-size img)))
           (offset (floor (- (/ (window-text-width) 2) (/ width 2)))))
      (overlay-put (ov-at) 'before-string (make-string offset ? ))))
   <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">Right justification</span>
   ((<span style="color: #0000FF;">and</span> (eq 'right (plist-get org-format-latex-options <span style="color: #006FE0;">:justify</span>)) 
         (= beg (line-beginning-position)))
    (<span style="color: #0000FF;">let*</span> ((img (create-image image 'imagemagick t))
           (width (car (image-display-size (overlay-get (ov-at) 'display))))
           (offset (floor (- (window-text-width) width (- (line-end-position) end)))))
      (overlay-put (ov-at) 'before-string (make-string offset ? ))))))

(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">org-latex-fragment-tooltip</span> (beg end image imagetype)
  <span style="color: #036A07;">"Add the fragment tooltip to the overlay and set click function to toggle it."</span>
  (overlay-put (ov-at) 'help-echo
               (concat (buffer-substring beg end)
                       <span style="color: #008000;">"mouse-1 to toggle."</span>))
  (overlay-put (ov-at) 'local-map (<span style="color: #0000FF;">let</span> ((map (make-sparse-keymap)))
                                    (define-key map [mouse-1]
                                      `(<span style="color: #0000FF;">lambda</span> ()
                                         (<span style="color: #0000FF;">interactive</span>)
                                         (org-remove-latex-fragment-image-overlays ,beg ,end)))
                                    map)))

<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">advise the function to a</span>
(advice-add 'org--format-latex-make-overlay <span style="color: #006FE0;">:after</span> 'org-justify-fragment-overlay)
(advice-add 'org--format-latex-make-overlay <span style="color: #006FE0;">:after</span> 'org-latex-fragment-tooltip)
</pre>
</div>

<p>
That is it. If you get tired of the advice, remove it like this:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(advice-remove 'org--format-latex-make-overlay 'org-justify-fragment-overlay)
(advice-remove 'org--format-latex-make-overlay 'org-latex-fragment-tooltip)
</pre>
</div>
<p>Copyright (C) 2016 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p>
<p><a href="/org/2016/11/06/Justifying-LaTeX-preview-fragments-in-org-mode.org">org-mode source</a></p>
<p>Org-mode version = 9.0</p>